#### First attempt: Merge two tables
##### preparations/tables/*.csv

In [2]:
import pandas as pd

In [4]:
df1 = pd.read_csv('preparations/tables/titanic_train_prep1.csv')
df2 = pd.read_csv('preparations/tables/titanic_train_prep2.csv')

In [22]:
df1.head(3)

,PassengerId,Survived,Pclass,Name,Title,check_sex,Name_last,Sex,Age,family,Ticket,Ticket_num,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",Mr,1.0,Braund,male,22.0,1,A/5 21171,521171.0,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Mrs,1.0,Cumings,female,38.0,1,PC 17599,17599.0,71.2833,C,C
2,3,1,3,"Heikkinen, Miss. Laina",Miss,1.0,Heikkinen,female,26.0,0,STON/O2. 3101282,23101282.0,7.9250,NaN,S

In [14]:
# df2.head(3)
df2.shape

(891, 10)

In [23]:
# Auto-merge method I: Concatenate all columns, duplicates keep
merge_df0 = pd.concat([df1, df2], axis=1)
merge_df0.head(3)
merge_df0.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Title', 'check_sex',
       'Name_last', 'Sex', 'Age', 'family', 'Ticket', 'Ticket_num', 'Fare',
       'Cabin', 'Embarked', 'Survived', 'Pclass', 'Title', 'Sex', 'Age',
       'SibSp', 'FamilySize', 'Parch', 'Fare', 'Embarked'],
      dtype='object')

In [24]:
# Auto-merge method II: Concatenate all columns, duplicates(column name and column values equal) drop
# Concatenate them horizontally (row-wise match)
merged_df1 = pd.concat([df1, df2], axis=1)

# Drop columns with duplicated content (not just duplicated names)
merged_df1 = merged_df1.loc[:, ~merged_df1.T.duplicated(keep='first')]
merged_df1.head(3)
merged_df1.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Title', 'check_sex',
       'Name_last', 'Sex', 'Age', 'family', 'Ticket', 'Ticket_num', 'Fare',
       'Cabin', 'Embarked', 'Title', 'Sex', 'SibSp', 'FamilySize', 'Parch',
       'Fare', 'Embarked'],
      dtype='object')